using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Description
{
    class Info
    {
        public readonly static string descr = @"Задача № 1. Вывести на экран сообщение «Hello World!»
Задача № 2. Вывести на экран три числа в порядке, обратном вводу
Задача № 3. Вывести на экран квадрат введенного числа
Задача № 4. Получить реверсную запись трехзначного числа
Задача № 5. Посчитать количество единичных битов числа
Задача № 6. Вывести на экран наибольшее из двух чисел
Задача № 7. Вывести на экран наибольшее из трех чисел
Задача № 8. Вывести название дня недели по его номеру
Задача № 9. Проверить, является ли четырехзначное число палиндромом
Задача № 10. Проверить, является ли четырехзначное число счастливым билетом
Задача № 11. Проверить, является ли двоичное представление числа палиндромом
Задача № 12. Решить квадратное уравнение
Задача № 13. Вывести на экран все натуральные числа до заданного
Задача № 14. Найти наибольший нетривиальный делитель натурального числа
Задача № 15. Найти наименьший нетривиальный делитель натурального числа
Задача № 16. Подсчитать общее число делителей натурального числа
Задача № 17. Проверить, является ли заданное натуральное число простым
Задача № 18. Вывести на экран все простые числа до заданного
Задача № 19. Вывести на экран первых n простых чисел
Задача № 20. Проверить, является ли заданное натуральное число совершенным
Задача № 21. Проверить, являются ли два натуральных числа дружественными
Задача № 22. Найти наибольший общий делитель двух натуральных чисел
Задача № 23. Найти наименьшее общее кратное двух натуральных чисел
Задача № 24. Вычислить x^n
Задача № 25. Вычислить x^n по алгоритму быстрого возведения в степень
Задача № 26. Решить квадратное уравнение заданного вида с параметром
Задача № 27. Вычислить значение многочлена в точке
Задача № 28. Вычислить факториал
Задача № 29. Вычислить число сочетаний из n по k
Задача № 30. Вывести таблицу квадратов и кубов всех натуральных чисел до n
Задача № 31. Сформировать реверсную запись заданного числа
Задача № 32. Проверить монотонность последовательности цифр числа
Задача № 33. Получить каноническое разложение числа на простые сомножители
Задача № 34. Сформировать число из двух заданных чередованием разрядов
Задача № 35. Вывести на экран x, записанное в системе счисления с основанием n
Задача № 36. Найти наименьший нетривиальный делитель двух заданных чисел
Задача № 37. Проверить, является ли натуральное число счастливым билетом
Задача № 38. Проверить, является ли натуральное число палиндромом
Задача № 39. Проверить, является ли натуральное число степенью двойки
Задача № 40. Вывести на экран произведение четных элементов заданной последовательности натуральных чисел
Задача № 41. Вывести на экран произведение двузначных элементов последовательности натуральных чисел, которые делятся на заданное число
Задача № 42. Найти количество простых членов последовательности
Задача № 43. Проверить, начинается ли каждый из членов последовательности с десятичной цифры, на которую оканчивается предыдущий
Задача № 44. Проверить, является ли последовательность пилообразной
Задача № 45. Проверить, является ли последовательность строго монотонной
Задача № 46. Вывести на экран n-ное число Фибоначчи
Задача № 47. Вывести на экран сумму чисел Фибоначчи до n-ного включительно
Задача № 48. Вывести на экран все числа Фибоначчи до n-ного включительно
Задача № 49. Проверить баланс круглых скобок в символьном выражении
Задача № 50. Вычислить экспоненту с заданной точностью";

    }
}
